Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_NotFullyConnected Property
 The network is not well connected. Some elements may have unexpected flow and pressure loss values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_NotFullyConnected { get; }
Public Shared ReadOnly Property Network_NotFullyConnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_NotFullyConnected {
	FailureDefinitionId^ get ();
}
static member Network_NotFullyConnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace